/**********************************************************************************************************
*文件说明：NoneQuadrotor UAV飞行控制代码
*实现功能：实现无人机精准控制
*修改日期：2018-11-17
*修改作者：crystal cup
*修改备注：
**********************************************************************************************************/
#include "drv_ist8310.h"
#include "copter.h"

Vector3i_t magRaw;


/**********************************************************************************************************
*函数原型:static void IST8310_WriteReg(u8 REG_Address,u8 REG_data)
*函数功能:IST8310写寄存器
*输入参数: 
*返回数据: none
*修改日期: 2018-11-27
*备注信息：
**********************************************************************************************************/
static void IST8310_WriteReg(u8 REG_Address,u8 REG_data)
{
    IIC3_Write_1Byte(IST8310_ADDRESS, REG_Address, REG_data);
}


/**********************************************************************************************************
*函数原型:static uint8_t IST8310_ReadReg(u8 REG_Address)
*函数功能:产生IIC起始信号
*输入参数: 
*返回数据: none
*修改日期: 2018-11-17
*备注信息：
**********************************************************************************************************/
uint8_t ab=0;
static uint8_t IST8310_ReadReg(u8 REG_Address)
{
	uint8_t *REG_data=0;
	IIC3_Read_1Byte(IST8310_ADDRESS, REG_Address,REG_data);
	ab=*REG_data;
    return *REG_data;
}


/**********************************************************************************************************
*函数原型:bool IST8310_Detect(void)
*函数功能:识别
*输入参数: 
*返回数据: none
*修改日期: 2018-11-27
*备注信息：
**********************************************************************************************************/
uint8_t dtst=0;
bool IST8310_Detect(void)
{
	
    if(IST8310_ReadReg(IST8310_REG_WHOAMI) == IST8310_CHIP_ID)
	{
		dtst=1;
	   return true;
	}
       
    else
	{
	    return false;
	}
}


/**********************************************************************************************************
*函数原型:void IST8310_Init(void)
*函数功能:ist8310初始化
*输入参数: 
*返回数据: none
*修改日期: 2018-11-17
*备注信息：
**********************************************************************************************************/
void IST8310_Init(void)
{
    IST8310_WriteReg(IST8310_REG_CNTRL1, IST8310_ODR_200_HZ);
    delay_ms(5);
}

/**********************************************************************************************************
*函数原型:void IST8310_Update(void)
*函数功能:更新数据
*输入参数: 
*返回数据: none
*修改日期: 2018-11-27
*备注信息：
**********************************************************************************************************/
void IST8310_Update(void)
{
    uint8_t buffer[6];

    buffer[1] = IST8310_ReadReg(IST8310_REG_HX_L);
    buffer[0] = IST8310_ReadReg(IST8310_REG_HX_H);
    magRaw.x = (int16_t)buffer[0] << 8 | buffer[1];

    buffer[3] = IST8310_ReadReg(IST8310_REG_HY_L);
    buffer[2] = IST8310_ReadReg(IST8310_REG_HY_H);
    magRaw.y = (int16_t)buffer[2] << 8 | buffer[3];

    buffer[5] = IST8310_ReadReg(IST8310_REG_HZ_L);
    buffer[4] = IST8310_ReadReg(IST8310_REG_HZ_H);
    magRaw.z = (int16_t)buffer[4] << 8 | buffer[5];

    //统一传感器坐标(并非定义安装方向)
    magRaw.x = magRaw.x;
    magRaw.y = -magRaw.y;
    magRaw.z = magRaw.z;
}

/**********************************************************************************************************
*函数原型:void IST8310_Read(Vector3f_t* mag)
*函数功能:读取数据
*输入参数: 
*返回数据: none
*修改日期: 2018-11-27
*备注信息：
**********************************************************************************************************/
void IST8310_Read(Vector3f_t* mag)
{
    mag->x = magRaw.x * IST8310_MAG_TO_GAUSS;
    mag->y = magRaw.y * IST8310_MAG_TO_GAUSS;
    mag->z = magRaw.z * IST8310_MAG_TO_GAUSS;
}


/***********************************************************************************************************
*                               NoneQuadrotor UAV file_end
***********************************************************************************************************/

