/**********************************************************************************************************
*文件说明：NoneQuadrotor UAV飞行控制代码
*实现功能：实现无人机精准控制
*修改日期：2018-11-17
*修改作者：crystal cup
*修改备注：应用程序入口
**********************************************************************************************************/
#include "sensor.h"
#include "copter.h"

IMU_SENSOR_t imu_sensor;


/**********************************************************************************************************
*函数原型: int main(void)
*函数功能: main函数入口
*输入参数: pvParameters
*返回数据: none
*修改日期: 2018-11-17
*备注信息：
**********************************************************************************************************/

void IMU_Init(void)
{
  if(IMU1_SENSOR==1)
	{
	
	
	}
	else if(IMU2_SENSOR==1)
	{
	
	
	}
	else if(IMU3_SENSOR==1)
	{
	
	
	}





}


