/**********************************************************************************************************
*文件说明：mathtool文件实现
*实现功能：常用的数学公式
*修改日期：2018-10-31
*修改作者：crystal cup
*修改备注：
**********************************************************************************************************/

#include "mathtool.h"


/**********************************************************************************************************
*函数原型：float SafeArcsin(float v)
*函数功能：带有安全区域的反正弦函数
*输入形参：v：输入值
*返回数据：反正弦值
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
float SafeArcsin(float v)
{
    if (isnan(v)) 
		{
        return 0.0;
    }
    if (v >= 1.0f) 
		{
        return M_PI/2;
    }
    if (v <= -1.0f) 
		{
        return -M_PI/2;
    }
    return asinf(v);
}

/**********************************************************************************************************
*函数原型：float ConstrainFloat(float amt, float low, float high) 
*函数功能：浮点限制幅度
*输入形参：amt：输入值;  low:最低值;  high:最高值
*返回数据：amt处理后的值
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
float ConstrainFloat(float amt, float low, float high) 
{
	if (isnan(amt)) 
    {
		return (low+high)*0.5f;
	}
	return ((amt)<(low)?(low):((amt)>(high)?(high):(amt)));
}

/**********************************************************************************************************
*函数原型：int16_t ConstrainInt16(int16_t amt, int16_t low, int16_t high) 
*函数功能：16位有符号限制幅度
*输入形参：amt：输入值;  low:最低值;  high:最高值
*返回数据：amt处理后的值
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
int16_t ConstrainInt16(int16_t amt, int16_t low, int16_t high) 
{
	return ((amt)<(low)?(low):((amt)>(high)?(high):(amt)));
}


/**********************************************************************************************************
*函数原型：uint16_t ConstrainUint16(uint16_t amt, uint16_t low, uint16_t high)
*函数功能：16位无符号整形限制幅度
*输入形参：amt：输入值;  low:最低值;  high:最高值
*返回数据：amt处理后的值
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
uint16_t ConstrainUint16(uint16_t amt, uint16_t low, uint16_t high)
{
	return ((amt)<(low)?(low):((amt)>(high)?(high):(amt)));
}


/**********************************************************************************************************
*函数原型：int32_t ConstrainInt32(int32_t amt, int32_t low, int32_t high) 
*函数功能：32位整形限制幅
*输入形参：amt：输入值;  low:最低值;  high:最高值
*返回数据：amt处理后的值
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
int32_t ConstrainInt32(int32_t amt, int32_t low, int32_t high) 
{
	return ((amt)<(low)?(low):((amt)>(high)?(high):(amt)));
}



/**********************************************************************************************************
*函数原型：int32_t ApplyDeadbandInt(int32_t value, int32_t deadband)
*函数功能：死区限制,整形类型
*输入形参：value：输入值; deadband:死区限制值
*返回数据：返回value处理值
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
int32_t ApplyDeadbandInt(int32_t value, int32_t deadband)
{
    if (abs(value) < deadband)
    {
        value = 0;
    }
    else if (value > 0) 
    {
        value -= deadband;
    } 
    else if (value < 0) 
    {
        value += deadband;
    }
    return value;
}


/**********************************************************************************************************
*函数原型：float ApplyDeadbandFloat(float value, float deadband)
*函数功能：死区限制,浮点类型
*输入形参：value：输入值; deadband:死区限制值
*返回数据：返回value处理值
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
float ApplyDeadbandFloat(float value, float deadband)
{
    if (abs(value) < deadband) 
    {
        value = 0;
    } 
    else if (value > 0) 
    {
        value -= deadband;
    }
    else if (value < 0) 
    {
        value += deadband;
    }
    return value;
}


/**********************************************************************************************************
*函数原型：float Radians(float deg) 
*函数功能：角度转弧度
*输入形参：deg：角度
*返回数据：弧度
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
float Radians(float deg) 
{
	return deg * DEG_TO_RAD;
}



/**********************************************************************************************************
*函数原型：float Degrees(float rad) 
*函数功能：弧度到角度
*输入形参：rad：输入弧度值
*返回数据：角度值
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
float Degrees(float rad) 
{
	return rad * RAD_TO_DEG;
}



/**********************************************************************************************************
*函数原型：float Sq(float v) 
*函数功能：求平方
*输入形参：v：输入值
*返回数据：v的平方
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
float Sq(float v) 
{
	return v*v;
}

/**********************************************************************************************************
*函数原型：float Pythagorous2(float a, float b) 
*函数功能：2维向量长度
*输入形参：a:变量; b：变量
*返回数据：获取二维向量长度
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
float Pythagorous2(float a, float b) 
{
	return sqrtf(Sq(a)+Sq(b));
}

/**********************************************************************************************************
*函数原型：float Pythagorous3(float a, float b, float c) 
*函数功能：3维向量长度
*输入形参：a:变量; b：变量; c:变量
*返回数据：获取三维向量长度
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/

float Pythagorous3(float a, float b, float c) 
{
	return sqrtf(Sq(a)+Sq(b)+Sq(c));
}


/**********************************************************************************************************
*函数原型：float Pythagorous4(float a, float b, float c, float d) 
*函数功能：4维向量长度
*输入形参：a:变量; b：变量; c:变量；d:变量
*返回数据：获取四维向量长度
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
float Pythagorous4(float a, float b, float c, float d) 
{
	return sqrtf(Sq(a)+Sq(b)+Sq(c)+Sq(d));
}


/**********************************************************************************************************
*函数原型：float WrapDegree360(float angle)
*函数功能：角度限制幅度在0-360
*输入形参：angle：角度值
*返回数据：angle：角度值
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
float WrapDegree360(float angle)
{
    if(angle >= 360) 
        angle -= 360;
    if(angle < 0) 
        angle += 360;
    return angle;
}

/**********************************************************************************************************
*函数原型：int32_t GetRandom(void)
*函数功能：获取一个随机数
*输入形参：none
*返回数据：随机数据
*修改日期：2018-10-31
*修改备注：
**********************************************************************************************************/
int32_t GetRandom(void)
{
	return rand();
}


/***********************************************************************************************************
*                               NoneQuadrotor UAV file_end
***********************************************************************************************************/
